jobpostingrails/app/controllers/candidateprofile_controller.rb

def index

    # usr = User.find_by('email': params[:email])
    #     if(usr.nil?)
    #         render json: "User Not Found"
    #     else
    #         if(usr.authenticate(params[:password]))
    #             session[:current_user_id] = usr.id
    #             puts usr
    #             prf=Candidateprofile.find_by('email': usr.email)
    #             render json: prf

    prf=Candidateprofile.find(1);
---
SELECT "candidateprofiles".* FROM "candidateprofiles" WHERE "candidateprofiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]