jobpostingrails/app/controllers/candidateprofile_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]
---
def index

    usr = User.find_by('email': params[:email])

SELECT "candidateprofiles".* FROM "candidateprofiles" WHERE "candidateprofiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
 def show

    v= Candidateprofile.find(params[:id])

SELECT "candidateprofiles".* FROM "candidateprofiles" WHERE "candidateprofiles"."email" = $1 LIMIT $2  [["email", "Test@gmail.com"], ["LIMIT", 1]]
UPDATE "candidateprofiles" SET "profilePic" = $1, "experience" = $2, "currentRole" = $3, "updated_at" = $4 WHERE "candidateprofiles"."id" = $5  [["profilePic", "https://photos.app.goo.gl/jVnjxJakd9ELJUuY9"], ["experience", 7], ["currentRole", "Manager"], ["updated_at", "2023-01-26 18:16:58.572212"], ["id", 1]]
---
 def update

                prf=Candidateprofile.find_by('email': params[:email])
                # prf=Candidateprofile.find(1);
                puts params[:email]
                puts prf
    prf.update('firstName': params[:firstName],'lastName': params[:lastName], 'contact': params[:contact],'address': params[:address],'about': params[:about],'currentCompany': params[:currentCompany],'ctc': params[:ctc],'experience': params[:experience],'currentRole': params[:currentRole],'skills': params[:skills],'expectedSalary': params[:expectedSalary],'preferredLocation': params[:preferredLocation],'resumeLink': params[:resumeLink],'profilePic': params[:profilePic])