jobpostingrails/app/controllers/candidateapplication_controller.rb

    def create

        puts "******************User application Create***********************"
        curr_usr=User.find_by_id(session[:current_user_id])
        if(curr_usr.nil?)
            render json: "Not logged in"
        else



        p=Candidateapplication.create('user_id': curr_usr.id,'jobid': params[:jobid],
        'jobcode': params[:jobcode],
        'jobtitle': params[:jobtitle],
        'location': params[:location],
        'applieddate': params[:applieddate],
        'candidateappstatus': "Applied",
        'posteddate': params[:posteddate],
        'jobcode': params[:jobcode])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "candidateapplications" ("user_id", "jobid", "jobcode", "jobtitle", "location", "applieddate", "candidateappstatus", "posteddate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

def modify

        ca=Candidateapplication.where(:jobid=>params[:jobid])
        puts ca.size

    p=ca.update('candidateappstatus': params[:candidateappstatus])
---
SELECT "candidateapplications".* FROM "candidateapplications" WHERE "candidateapplications"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "candidateapplications".* FROM "candidateapplications" WHERE "candidateapplications"."jobid" = $1  [["jobid", 48]]
SELECT COUNT(*) FROM "candidateapplications" WHERE "candidateapplications"."jobid" = $1  [["jobid", 48]]
UPDATE "candidateapplications" SET "candidateappstatus" = $1, "updated_at" = $2 WHERE "candidateapplications"."id" = $3  [["candidateappstatus", "Rejected"], ["updated_at", "2023-01-26 12:48:48.249710"], ["id", 42]]

    def index

        curr_usr=User.find_by_id(session[:current_user_id])
        # curr_usr=User.find(1)
        puts session[:current_user_id]

        puts "*********************user application Display*********************************"
        puts curr_usr
        if(curr_usr.nil?)
            render json: "Not logged in"
        else
            jb=Candidateapplication.where(:user_id=>curr_usr.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "candidateapplications".* FROM "candidateapplications" WHERE "candidateapplications"."user_id" = $1  [["user_id", 1]]

    def shortlisted
        curr_usr=User.find_by_id(session[:current_user_id])
        puts "***************Application Shortlisted************************"
        puts curr_usr
        if(curr_usr.nil?)
            render json: "Not logged in"
        else
            ca1=Candidateapplication.where(:user_id=> curr_usr.id,:candidateappstatus=> "Shortlisted")
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "candidateapplications".* FROM "candidateapplications" WHERE "candidateapplications"."user_id" = $1 AND "candidateapplications"."candidateappstatus" = $2  [["user_id", 1], ["candidateappstatus", "Shortlisted"]]

    def offer
        curr_usr=User.find_by_id(session[:current_user_id])
        puts "***************Application Shortlisted************************"
        if(curr_usr.nil?)
            render json: "Not logged in"
        else
            ca1=Candidateapplication.where(:user_id=> curr_usr.id,:candidateappstatus=> "Offer Recieved")
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "candidateapplications".* FROM "candidateapplications" WHERE "candidateapplications"."user_id" = $1 AND "candidateapplications"."candidateappstatus" = $2  [["user_id", 1], ["candidateappstatus", "Offer Recieved"]]

    def reject
        curr_usr=User.find_by_id(session[:current_user_id])
        puts "***************Application Shortlisted************************"
        if(curr_usr.nil?)
            render json: "Not logged in"
        else
            ca1=Candidateapplication.where(:user_id=> curr_usr.id,:candidateappstatus=> "Rejected")
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "candidateapplications".* FROM "candidateapplications" WHERE "candidateapplications"."user_id" = $1 AND "candidateapplications"."candidateappstatus" = $2  [["user_id", 1], ["candidateappstatus", "Rejected"]]

    def interview
        curr_usr=User.find_by_id(session[:current_user_id])
        puts "***************Application Shortlisted************************"
        if(curr_usr.nil?)
            render json: "Not logged in"
        else
            ca1=Candidateapplication.where(:user_id=> curr_usr.id,:candidateappstatus=> "Interviewing")
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "candidateapplications".* FROM "candidateapplications" WHERE "candidateapplications"."user_id" = $1 AND "candidateapplications"."candidateappstatus" = $2  [["user_id", 1], ["candidateappstatus", "Interviewing"]]