jobpostingrails/app/controllers/job_controller.rb

    def searcheligible
        arr1=[1,2,3,4,5,6,1,2,3]
        curr_usr=User.find_by_id(session[:current_user_id])
        # curr_usr=User.find(1)
        puts session[:current_user_id]

        puts "*********************Job Display*********************************"
        puts curr_usr
        if(curr_usr.nil?)
            render json: "Not logged in"
        else
            cp=Candidateprofile.where(:email=> curr_usr.email)
         puts cp

            final=[]

            if (",".in? cp.first.skills )

                str= cp.first.skills.split(",")
                str.each do |i|
                    jb=Job.where("skillsrequired LIKE '%#{i}%'")

                    final=final+jb
                end
            else
                str=[cp.first.skills]
---
SELECT "candidateprofiles".* FROM "candidateprofiles" WHERE "candidateprofiles"."email" = $1  [["email", "Test@gmail.com"]]