jobpostingrails/app/controllers/job_controller.rb

    def index

        curr_usr=User.find_by_id(session[:current_user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def count

        curr_usr=User.find_by_id(session[:current_user_id])
        # curr_usr=User.find(1)
        puts session[:current_user_id]

        puts "*********************Job Count*********************************"
        puts curr_usr
        if(curr_usr.nil?)
            render json: "Not logged in"
        else
            ajb=Job.all.size
            cp=Candidateprofile.where(:email=> curr_usr.email)
            ca=Candidateapplication.where(:user_id=> curr_usr.id)

            final=[]
           jb=""
            if (",".in? cp.first.skills )

                str= cp.first.skills.split(",")
                str.each do |i|
                    jb=jb+"skillsrequired LIKE '%#{i}%'" + " or "
                    puts i
                    # final=final+jb
                end
            else
                str=cp.first.skills
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "candidateprofiles".* FROM "candidateprofiles" WHERE "candidateprofiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "candidateprofiles".* FROM "candidateprofiles" WHERE "candidateprofiles"."email" = $1 ORDER BY "candidateprofiles"."id" ASC LIMIT $2  [["email", "Test@gmail.com"], ["LIMIT", 1]]
SELECT "candidateprofiles".* FROM "candidateprofiles" WHERE "candidateprofiles"."email" = $1  [["email", "Test@gmail.com"]]

    def countapp

        curr_usr=User.find_by_id(session[:current_user_id])
        # curr_usr=User.find(1)
        puts session[:current_user_id]

        puts "*********************Job User status Count*********************************"
        puts curr_usr
        if(curr_usr.nil?)
            render json: "Not logged in"
        else

            ca1=Candidateapplication.where(:user_id=> curr_usr.id,:candidateappstatus=> "Shortlisted")
            ca2=Candidateapplication.where(:user_id=> curr_usr.id,:candidateappstatus=> "Interviewing")
            ca3=Candidateapplication.where(:user_id=> curr_usr.id,:candidateappstatus=> "Rejected")
            ca4=Candidateapplication.where(:user_id=> curr_usr.id,:candidateappstatus=> "Offer Recieved")

            shjb=ca1.size
            ijb=ca2.size
            rjb=ca3.size
            oljb=ca4.size
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "candidateapplications" WHERE "candidateapplications"."user_id" = $1 AND "candidateapplications"."candidateappstatus" = $2  [["user_id", 1], ["candidateappstatus", "Shortlisted"]]
SELECT COUNT(*) FROM "candidateapplications" WHERE "candidateapplications"."user_id" = $1 AND "candidateapplications"."candidateappstatus" = $2  [["user_id", 1], ["candidateappstatus", "Interviewing"]]

    def searcheligible

        curr_usr=User.find_by_id(session[:current_user_id])
        # curr_usr=User.find(1)
        puts session[:current_user_id]

        puts "*********************Job Display*********************************"
        puts curr_usr
        if(curr_usr.nil?)
            render json: "Not logged in"
        else
            cp=Candidateprofile.where(:email=> curr_usr.email)

         puts cp

            final=[]

            if (",".in? cp.first.skills )
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "candidateprofiles".* FROM "candidateprofiles" WHERE "candidateprofiles"."email" = $1  [["email", "Test@gmail.com"]]
SELECT "candidateprofiles".* FROM "candidateprofiles" WHERE "candidateprofiles"."email" = $1 LIMIT $2  [["email", "Test@gmail.com"], ["LIMIT", 11]]

    def appliedjob
        curr_usr=User.find_by_id(session[:current_user_id])
        # curr_usr=User.find(1)
        puts session[:current_user_id]

        puts "*********************Applied Job Display*********************************"
        puts curr_usr
        if(curr_usr.nil?)
            render json: "Not logged in"
        else
            cp=Candidateapplication.where(:user_id=> curr_usr.id)
            final=[]
            cp.each do |i|
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "candidateapplications".* FROM "candidateapplications" WHERE "candidateapplications"."user_id" = $1  [["user_id", 1]]