jobpostingrails/app/controllers/login_controller.rb

    def create
        usr = User.find_by('email': params[:email])
        if(usr.nil?)
            render json: "User Not Found"
        else
            if(usr.authenticate(params[:password]))
                session[:current_user_id] = usr.id
                puts usr
                prf=Candidateprofile.find_by('email': usr.email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "Test@gmail.com"], ["LIMIT", 1]]
SELECT "candidateprofiles".* FROM "candidateprofiles" WHERE "candidateprofiles"."email" = $1 LIMIT $2  [["email", "Test@gmail.com"], ["LIMIT", 1]]