jobpostingrails/app/controllers/skilltable_controller.rb

SELECT "skilltables".* FROM "skilltables"
---
    def index
        render json: Skilltable.all;

INSERT INTO "skilltables" ("skillname", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["skillname", "Data Science"], ["created_at", "2023-01-28 17:42:07.978223"], ["updated_at", "2023-01-28 17:42:07.978223"]]
---
    def create
        v = !params[:skillname].empty?
        if (v)
        Skilltable.create(
            'skillname': params[:skillname]


            )