jobpostingrails/app/controllers/user_controller.rb

def show
  v= User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

def index
  curr_usr=User.find_by_id(session[:current_user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]