jobpostingrails/app/controllers/user_controller.rb

    def create

        puts "******************User Create***********************"


      p=User.create('email': params[:email],
        'password': params[:password],
        'usertype': "Student")
        cp=Candidateprofile.create('email': params[:email])
---
INSERT INTO "users" ("email", "password_digest", "usertype", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "Test2@gmail.com"], ["password_digest", "[FILTERED]"], ["usertype", "Student"], ["created_at", "2023-01-25 08:47:08.895533"], ["updated_at", "2023-01-25 08:47:08.895533"]]
INSERT INTO "candidateprofiles" ("firstName", "lastName", "email", "contact", "address", "about", "profilePic", "currentCompany", "ctc", "experience", "currentRole", "skills", "resumeLink", "expectedSalary", "preferredLocation", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"

def show
    v = User.all
---
SELECT "users".* FROM "users"

def loggedin
  curr_usr=User.find_by_id(session[:current_user_id])
        # curr_usr=User.find(1)
        puts session[:current_user_id]
        if(curr_usr.nil?)
          curr={:status=> false }
      else

        prf=Candidateprofile.find_by('email': curr_usr.email)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "candidateprofiles".* FROM "candidateprofiles" WHERE "candidateprofiles"."email" = $1 LIMIT $2  [["email", "Test@gmail.com"], ["LIMIT", 1]]